create database shop_db encoding 'UTF-8';

create table customers
(
    customer_id serial primary key,
    first_name  text not null,
    last_name   text not null
);

create table goods
(
    goods_id     serial primary key,
    product_name text not null,
    price        real check ( price >= 0 )
);

create table purchases
(
    customer_id   int  not null,
    goods_id      int  not null,
    purchase_time date not null
);


insert into customers (first_name, last_name)
values ('Андрей', 'Никифоров'),
       ('Виталий', 'Хлыст'),
       ('Геннадий', 'Шурупов'),
       ('Елизар', 'Архипов'),
       ('Дмитрий', 'Онегин'),
       ('Иван', 'Назаров'),
       ('Анатолий', 'Архипов');

insert into goods (product_name, price)
values ('хлеб', 35.2),
       ('молоко', 90.7),
       ('яйца', 110.49),
       ('мука', 205.99),
       ('тушенка', 307.18),
       ('колбаса', 272.79),
       ('сыр', 319.59);

insert into purchases (customer_id, goods_id, purchase_time)
values (1, 1, '2022-09-01'),
       (1, 3, '2022-09-06'),
       (1, 3, '2022-09-07'),
       (1, 4, '2021-04-12'),
       (1, 5, '2021-12-13'),
       (2, 2, '2022-02-27'),
       (2, 2, '2022-05-01'),
       (2, 2, '2022-07-03'),
       (2, 7, '2022-06-05'),
       (4, 7, '2021-10-04'),
       (4, 7, '2022-08-04'),
       (4, 1, '2022-08-18'),
       (5, 2, '2022-08-22'),
       (6, 5, '2022-03-21'),
       (5, 6, '2022-01-27'),
       (3, 7, '2022-01-28'),
       (7, 3, '2022-09-02'),
       (7, 2, '2022-09-02'),
       (1, 2, '2022-07-03'),
       (6, 2, '2022-04-12'),
       (2, 5, '2022-05-12'),
       (3, 3, '2019-07-13'),
       (3, 2, '2022-04-27'),
       (7, 5, '2021-04-01'),
       (7, 1, '2022-06-03'),
       (7, 6, '2022-06-05'),
       (6, 6, '2021-12-04'),
       (5, 1, '2022-03-04'),
       (3, 3, '2022-02-18'),
       (5, 1, '2022-02-22'),
       (2, 2, '2022-06-21'),
       (2, 2, '2022-07-27'),
       (6, 3, '2022-06-28'),
       (4, 5, '2022-06-02'),
       (4, 6, '2022-05-02'),
       (4, 7, '2022-04-03'),
       (4, 4, '2022-04-12');